# pandas

#### :표형식의 데이터나 다양한 형태의 데이터를 다루는데 초점(index, name)
#### :Excel 형식과 비슷
#### (Numpy: 단일 산술배열 데이터를 다루는데 특화) : data만 존재, index(암묵적)

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.dtype

dtype('int64')

In [6]:
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])
print(obj2)
print('====================')
print(obj2.index)
print('====================')
print(obj2[['c','a','d']])

d    4
b    7
a   -5
c    3
dtype: int64
====================
Index(['d', 'b', 'a', 'c'], dtype='object')
====================
c    3
a   -5
d    4
dtype: int64

In [7]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [8]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [9]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [10]:
'b' in obj2

True

In [11]:
sdata={'kim':35000,'hong1':67000,'h3':40000} #dictionary =>Series 
obj3=pd.Series(sdata)
obj3

kim      35000
hong1    67000
h3       40000
dtype: int64

In [12]:
#기존 자료 추가
obj3.name='Salary'
obj3.index.name="Names"

In [13]:
obj3

Names
kim      35000
hong1    67000
h3       40000
Name: Salary, dtype: int64

In [14]:
#index 변경
obj3.index=['A','B','C']
obj3

A    35000
B    67000
C    40000
Name: Salary, dtype: int64

## 2. Data Frame

In [15]:
#행과 열의 구조를 가진 데이터 생성
data={'name':['hong1','hong2','hong3','hong4','hong5','hong6'],
     'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

    name  year  pop
0  hong1  2000  1.5
1  hong2  2001  1.7
2  hong3  2002  3.6
3  hong4  2001  2.4
4  hong5  2002  2.9
5  hong6  2003  3.2

In [16]:
frame.head() #첫 5개만 표현

    name  year  pop
0  hong1  2000  1.5
1  hong2  2001  1.7
2  hong3  2002  3.6
3  hong4  2001  2.4
4  hong5  2002  2.9

In [17]:
pd.DataFrame(data,columns=['year','name','pop'])

   year   name  pop
0  2000  hong1  1.5
1  2001  hong2  1.7
2  2002  hong3  3.6
3  2001  hong4  2.4
4  2002  hong5  2.9
5  2003  hong6  3.2

In [18]:
#행방향의 index
frame.index

RangeIndex(start=0, stop=6, step=1)

In [19]:
#열방향의 index
frame.columns

Index(['name', 'year', 'pop'], dtype='object')

In [20]:
#값 얻기
frame.values

array([['hong1', 2000, 1.5],
       ['hong2', 2001, 1.7],
       ['hong3', 2002, 3.6],
       ['hong4', 2001, 2.4],
       ['hong5', 2002, 2.9],
       ['hong6', 2003, 3.2]], dtype=object)

In [21]:
#각 인덱스에 대한 이름 설정하기
frame.index.name='Num'
frame.columns.name='Info'
frame

Info   name  year  pop
Num
0     hong1  2000  1.5
1     hong2  2001  1.7
2     hong3  2002  3.6
3     hong4  2001  2.4
4     hong5  2002  2.9
5     hong6  2003  3.2

In [35]:
frame

Info   name  year  pop
Num
0     hong1  2000  1.5
1     hong2  2001  1.7
2     hong3  2002  3.6
3     hong4  2001  2.4
4     hong5  2002  2.9
5     hong6  2003  3.2

In [23]:
frame2=pd.DataFrame(data,columns=['year','name','pop','debt'],
                   index=['one','two','three','four','five','six'])
frame2

       year   name  pop debt
one    2000  hong1  1.5  NaN
two    2001  hong2  1.7  NaN
three  2002  hong3  3.6  NaN
four   2001  hong4  2.4  NaN
five   2002  hong5  2.9  NaN
six    2003  hong6  3.2  NaN

In [24]:
frame2['name']

one      hong1
two      hong2
three    hong3
four     hong4
five     hong5
six      hong6
Name: name, dtype: object

In [25]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [26]:
frame2.loc['three'] #index3의 값들

year     2002
name    hong3
pop       3.6
debt      NaN
Name: three, dtype: object

In [27]:
frame2['debt']=16.5
frame2

       year   name  pop  debt
one    2000  hong1  1.5  16.5
two    2001  hong2  1.7  16.5
three  2002  hong3  3.6  16.5
four   2001  hong4  2.4  16.5
five   2002  hong5  2.9  16.5
six    2003  hong6  3.2  16.5

In [28]:
frame2['debt']=np.arange(6.)
frame2

       year   name  pop  debt
one    2000  hong1  1.5   0.0
two    2001  hong2  1.7   1.0
three  2002  hong3  3.6   2.0
four   2001  hong4  2.4   3.0
five   2002  hong5  2.9   4.0
six    2003  hong6  3.2   5.0

In [29]:
val= pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2

       year   name  pop  debt
one    2000  hong1  1.5   NaN
two    2001  hong2  1.7  -1.2
three  2002  hong3  3.6   NaN
four   2001  hong4  2.4  -1.5
five   2002  hong5  2.9  -1.7
six    2003  hong6  3.2   NaN

In [30]:
frame2['eastern']=frame2.name=='hong1'
frame2

       year   name  pop  debt  eastern
one    2000  hong1  1.5   NaN     True
two    2001  hong2  1.7  -1.2    False
three  2002  hong3  3.6   NaN    False
four   2001  hong4  2.4  -1.5    False
five   2002  hong5  2.9  -1.7    False
six    2003  hong6  3.2   NaN    False

In [31]:
del frame2['eastern']
frame2.columns

Index(['year', 'name', 'pop', 'debt'], dtype='object')

In [32]:
pop={'hong1':{2001:2.4,2002:2.9},
    'hong3':{2000:1.5,2001:1.7,2002:3.6}}
frame3=pd.DataFrame(pop)
frame3

      hong1  hong3
2000    NaN    1.5
2001    2.4    1.7
2002    2.9    3.6

In [33]:
frame3.T

       2000  2001  2002
hong1   NaN   2.4   2.9
hong3   1.5   1.7   3.6

In [34]:
pd.DataFrame(pop,index=[2001,2002,2003])#################################################################################

AttributeError: 'list' object has no attribute 'astype'

In [36]:
pdata={'hong1':frame3['hong1'][:-1],'hong3':frame3['hong3'][:2]}
pd.DataFrame(pdata)

      hong1  hong3
2000    NaN    1.5
2001    2.4    1.7

In [37]:
frame3.index.name='year'; frame3.columns.name='state'
frame3

state  hong1  hong3
year
2000     NaN    1.5
2001     2.4    1.7
2002     2.9    3.6

In [38]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [39]:
frame2.values

array([[2000, 'hong1', 1.5, nan],
       [2001, 'hong2', 1.7, -1.2],
       [2002, 'hong3', 3.6, nan],
       [2001, 'hong4', 2.4, -1.5],
       [2002, 'hong5', 2.9, -1.7],
       [2003, 'hong6', 3.2, nan]], dtype=object)

### 3. DataFrame Indexing

In [40]:
import numpy as np
import pandas as pd
data={'names':['hong1','hong2','hong3','hong4','hong5'],
     'year':[2000,2001,2002,2001,2002],
     'points':[1.5,1.7,3.6,2.4,2.9]}
df=pd.DataFrame(data,
                columns=['year','names','points','penalty'],
               index=['one','two','three','four','five'])
df

       year  names  points penalty
one    2000  hong1     1.5     NaN
two    2001  hong2     1.7     NaN
three  2002  hong3     3.6     NaN
four   2001  hong4     2.4     NaN
five   2002  hong5     2.9     NaN

In [41]:
#DataFrame 에서 열을 선택하고 조작
df['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
df.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [43]:
df[['year','names']]

       year  names
one    2000  hong1
two    2001  hong2
three  2002  hong3
four   2001  hong4
five   2002  hong5

In [44]:
df['penalty']=[0.1,0.2,0.3,0.4,0.5]
df

       year  names  points  penalty
one    2000  hong1     1.5      0.1
two    2001  hong2     1.7      0.2
three  2002  hong3     3.6      0.3
four   2001  hong4     2.4      0.4
five   2002  hong5     2.9      0.5

In [45]:
df['abc']=np.arange(5)
df

       year  names  points  penalty  abc
one    2000  hong1     1.5      0.1    0
two    2001  hong2     1.7      0.2    1
three  2002  hong3     3.6      0.3    2
four   2001  hong4     2.4      0.4    3
five   2002  hong5     2.9      0.5    4

In [46]:
#Series를 추가
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
df['bcd']=val
df

       year  names  points  penalty  abc  bcd
one    2000  hong1     1.5      0.1    0  NaN
two    2001  hong2     1.7      0.2    1 -1.2
three  2002  hong3     3.6      0.3    2  NaN
four   2001  hong4     2.4      0.4    3 -1.5
five   2002  hong5     2.9      0.5    4 -1.7

In [47]:
df['point_penalty']=df['points']-df['penalty']
df

       year  names  points  penalty  abc  bcd  point_penalty
one    2000  hong1     1.5      0.1    0  NaN            1.4
two    2001  hong2     1.7      0.2    1 -1.2            1.5
three  2002  hong3     3.6      0.3    2  NaN            3.3
four   2001  hong4     2.4      0.4    3 -1.5            2.0
five   2002  hong5     2.9      0.5    4 -1.7            2.4

In [48]:
df['true_false']=df['point_penalty']>2
df

       year  names  points  penalty  abc  bcd  point_penalty  true_false
one    2000  hong1     1.5      0.1    0  NaN            1.4       False
two    2001  hong2     1.7      0.2    1 -1.2            1.5       False
three  2002  hong3     3.6      0.3    2  NaN            3.3        True
four   2001  hong4     2.4      0.4    3 -1.5            2.0       False
five   2002  hong5     2.9      0.5    4 -1.7            2.4        True

In [49]:
#열삭제
del df['true_false']
del df['point_penalty']
df

       year  names  points  penalty  abc  bcd
one    2000  hong1     1.5      0.1    0  NaN
two    2001  hong2     1.7      0.2    1 -1.2
three  2002  hong3     3.6      0.3    2  NaN
four   2001  hong4     2.4      0.4    3 -1.5
five   2002  hong5     2.9      0.5    4 -1.7

In [50]:
#DataFrame에서 행을 선택하고 조작하기
df[0:3]

       year  names  points  penalty  abc  bcd
one    2000  hong1     1.5      0.1    0  NaN
two    2001  hong2     1.7      0.2    1 -1.2
three  2002  hong3     3.6      0.3    2  NaN

In [51]:
df['two':'four']

       year  names  points  penalty  abc  bcd
two    2001  hong2     1.7      0.2    1 -1.2
three  2002  hong3     3.6      0.3    2  NaN
four   2001  hong4     2.4      0.4    3 -1.5

In [52]:
df.loc['two'] #two 열의 정보출력

year        2001
names      hong2
points       1.7
penalty      0.2
abc            1
bcd         -1.2
Name: two, dtype: object

In [53]:
df.loc['two':'four']

       year  names  points  penalty  abc  bcd
two    2001  hong2     1.7      0.2    1 -1.2
three  2002  hong3     3.6      0.3    2  NaN
four   2001  hong4     2.4      0.4    3 -1.5

In [54]:
df.loc['two':'four','points']

two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [55]:
df.loc[:,'year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [56]:
df.loc[:,'year':'points']

       year  names  points
one    2000  hong1     1.5
two    2001  hong2     1.7
three  2002  hong3     3.6
four   2001  hong4     2.4
five   2002  hong5     2.9

In [57]:
#새로운 행 삽입하기
df.loc['six',:]=[2020,'sep',4.0,0.1,2.1,3.0] 
df

         year  names  points  penalty  abc  bcd
one    2000.0  hong1     1.5      0.1  0.0  NaN
two    2001.0  hong2     1.7      0.2  1.0 -1.2
three  2002.0  hong3     3.6      0.3  2.0  NaN
four   2001.0  hong4     2.4      0.4  3.0 -1.5
five   2002.0  hong5     2.9      0.5  4.0 -1.7
six    2020.0    sep     4.0      0.1  2.1  3.0

In [58]:
df.loc['a',:]=[2032,'abe',4.0,0.1,2.1,3.0] 
df

         year  names  points  penalty  abc  bcd
one    2000.0  hong1     1.5      0.1  0.0  NaN
two    2001.0  hong2     1.7      0.2  1.0 -1.2
three  2002.0  hong3     3.6      0.3  2.0  NaN
four   2001.0  hong4     2.4      0.4  3.0 -1.5
five   2002.0  hong5     2.9      0.5  4.0 -1.7
six    2020.0    sep     4.0      0.1  2.1  3.0
a      2032.0    abe     4.0      0.1  2.1  3.0

In [59]:
df=df.drop('a') #행제거하기
df

         year  names  points  penalty  abc  bcd
one    2000.0  hong1     1.5      0.1  0.0  NaN
two    2001.0  hong2     1.7      0.2  1.0 -1.2
three  2002.0  hong3     3.6      0.3  2.0  NaN
four   2001.0  hong4     2.4      0.4  3.0 -1.5
five   2002.0  hong5     2.9      0.5  4.0 -1.7
six    2020.0    sep     4.0      0.1  2.1  3.0

In [60]:
#iloc : index location

In [61]:
df.iloc[[0,1,3],[1,2]]

      names  points
one   hong1     1.5
two   hong2     1.7
four  hong4     2.4

In [62]:
df.iloc[:,1:4]

       names  points  penalty
one    hong1     1.5      0.1
two    hong2     1.7      0.2
three  hong3     3.6      0.3
four   hong4     2.4      0.4
five   hong5     2.9      0.5
six      sep     4.0      0.1

In [63]:
df.iloc[0,1]

'hong1'

### 4.DataRrame 에서 boolean indexing

In [64]:
df['year'] >2001

one      False
two      False
three     True
four     False
five      True
six       True
Name: year, dtype: bool

In [65]:
#2001 보다 큰 모든 행의 값
df.loc[df['year']>2001]

         year  names  points  penalty  abc  bcd
three  2002.0  hong3     3.6      0.3  2.0  NaN
five   2002.0  hong5     2.9      0.5  4.0 -1.7
six    2020.0    sep     4.0      0.1  2.1  3.0

In [66]:
df.loc[df['names']=='hong2',['names','points']]

     names  points
two  hong2     1.7

In [67]:
df.loc[df['points']>3,'penalty']=0
df

         year  names  points  penalty  abc  bcd
one    2000.0  hong1     1.5      0.1  0.0  NaN
two    2001.0  hong2     1.7      0.2  1.0 -1.2
three  2002.0  hong3     3.6      0.0  2.0  NaN
four   2001.0  hong4     2.4      0.4  3.0 -1.5
five   2002.0  hong5     2.9      0.5  4.0 -1.7
six    2020.0    sep     4.0      0.0  2.1  3.0

### 5. data

In [68]:
df=pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0  1.183346 -0.681891  0.155799 -0.654963
1 -0.498647 -0.106996 -0.591368  1.153433
2 -0.423555  0.459493 -0.476198 -2.027711
3 -0.133944 -1.150485 -1.639162 -0.577890
4  1.465801  0.202311  1.569213 -0.101972
5 -0.704376 -1.000415  0.573993 -0.981541

In [69]:
df.columns=['A','B','C','D']
df.index=pd.date_range('20191114',periods=6)
df

                   A         B         C         D
2019-11-14  1.183346 -0.681891  0.155799 -0.654963
2019-11-15 -0.498647 -0.106996 -0.591368  1.153433
2019-11-16 -0.423555  0.459493 -0.476198 -2.027711
2019-11-17 -0.133944 -1.150485 -1.639162 -0.577890
2019-11-18  1.465801  0.202311  1.569213 -0.101972
2019-11-19 -0.704376 -1.000415  0.573993 -0.981541

In [70]:
df['F']=[1.0,np.nan,3.5,6.1,np.nan,7.0] #nan 쓰면 오류남. np.nan쓰기
df

                   A         B         C         D    F
2019-11-14  1.183346 -0.681891  0.155799 -0.654963  1.0
2019-11-15 -0.498647 -0.106996 -0.591368  1.153433  NaN
2019-11-16 -0.423555  0.459493 -0.476198 -2.027711  3.5
2019-11-17 -0.133944 -1.150485 -1.639162 -0.577890  6.1
2019-11-18  1.465801  0.202311  1.569213 -0.101972  NaN
2019-11-19 -0.704376 -1.000415  0.573993 -0.981541  7.0

In [71]:
#NaN 없애기
df.dropna(how='any') #non이 하나라도 있으면 행 없애기

                   A         B         C         D    F
2019-11-14  1.183346 -0.681891  0.155799 -0.654963  1.0
2019-11-16 -0.423555  0.459493 -0.476198 -2.027711  3.5
2019-11-17 -0.133944 -1.150485 -1.639162 -0.577890  6.1
2019-11-19 -0.704376 -1.000415  0.573993 -0.981541  7.0

In [72]:
#NaN 없애기
df.dropna(how='all') #모든 값이 nan인 경우 행 없애기

                   A         B         C         D    F
2019-11-14  1.183346 -0.681891  0.155799 -0.654963  1.0
2019-11-15 -0.498647 -0.106996 -0.591368  1.153433  NaN
2019-11-16 -0.423555  0.459493 -0.476198 -2.027711  3.5
2019-11-17 -0.133944 -1.150485 -1.639162 -0.577890  6.1
2019-11-18  1.465801  0.202311  1.569213 -0.101972  NaN
2019-11-19 -0.704376 -1.000415  0.573993 -0.981541  7.0

In [73]:
#nan에 값 넣기
df.fillna(value=0.5)

                   A         B         C         D    F
2019-11-14  1.183346 -0.681891  0.155799 -0.654963  1.0
2019-11-15 -0.498647 -0.106996 -0.591368  1.153433  0.5
2019-11-16 -0.423555  0.459493 -0.476198 -2.027711  3.5
2019-11-17 -0.133944 -1.150485 -1.639162 -0.577890  6.1
2019-11-18  1.465801  0.202311  1.569213 -0.101972  0.5
2019-11-19 -0.704376 -1.000415  0.573993 -0.981541  7.0

In [74]:
df.isnull()

                A      B      C      D      F
2019-11-14  False  False  False  False  False
2019-11-15  False  False  False  False   True
2019-11-16  False  False  False  False  False
2019-11-17  False  False  False  False  False
2019-11-18  False  False  False  False   True
2019-11-19  False  False  False  False  False

In [75]:
#F열에서 nan 값을 포함하는 행만 추출하기
df.loc[df.isnull()['F'],:]

                   A         B         C         D   F
2019-11-15 -0.498647 -0.106996 -0.591368  1.153433 NaN
2019-11-18  1.465801  0.202311  1.569213 -0.101972 NaN

In [76]:
pd.to_datetime('20191114')

Timestamp('2019-11-14 00:00:00')

In [77]:
#특정행 드랍하기
df.drop([pd.to_datetime('20191115'),pd.to_datetime('20191119')])

                   A         B         C         D    F
2019-11-14  1.183346 -0.681891  0.155799 -0.654963  1.0
2019-11-16 -0.423555  0.459493 -0.476198 -2.027711  3.5
2019-11-17 -0.133944 -1.150485 -1.639162 -0.577890  6.1
2019-11-18  1.465801  0.202311  1.569213 -0.101972  NaN

In [78]:
# 특정열 삭제
df.drop(['B','D'],axis=1)

                   A         C    F
2019-11-14  1.183346  0.155799  1.0
2019-11-15 -0.498647 -0.591368  NaN
2019-11-16 -0.423555 -0.476198  3.5
2019-11-17 -0.133944 -1.639162  6.1
2019-11-18  1.465801  1.569213  NaN
2019-11-19 -0.704376  0.573993  7.0

In [79]:
### 5.Data 분석용 함수들

In [80]:
data=[[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]]
print(data)
df=pd.DataFrame(data,columns=['one','two'],index=['a','b','c','d'])
df

[[1.4, nan], [7.1, -4.5], [nan, nan], [0.75, -1.3]]

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [81]:
#행 방향으로 합(즉, 열의 합)
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [82]:
#열 방향으로 합(즉, 행의 합)
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [83]:
# nan이 계산에 참여하는 겨우
df.sum(axis=1,skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [84]:
#특정행이나 열에서 계산
df['one'].sum()

9.25

In [85]:
df.loc['b'].sum()

2.5999999999999996

In [86]:
df2=pd.DataFrame(np.random.randn(6,4),columns=['a','b','c','d'],
                index=pd.date_range("20191114",periods=6))
df2

                   a         b         c         d
2019-11-14  1.009799  0.618580  0.205743 -0.598951
2019-11-15 -0.038880  0.015271  0.300228 -1.240275
2019-11-16 -1.269698 -0.706938  1.080333  1.160118
2019-11-17  0.525519  0.875876  0.190388  0.025180
2019-11-18  1.653706  0.521844 -0.354555  1.727358
2019-11-19  0.032191  2.059692 -0.379014 -0.152282

In [87]:
# a열과 b열의 상관계수 구하기
df2['a'].corr(df2['b']) #0에 가까워 질수록 관계가 있다

0.39583650700227196

In [88]:
#B열과 C열의 공분산 구하기
df2['b'].cov(df2['c'])

-0.40383429402088283

In [89]:
#5.1.3 색인 객체

In [90]:
obj=pd.Series(range(3), index=['a','b','c'])
index=obj.index
print(index)
print(index[1:])

Index(['a', 'b', 'c'], dtype='object')
Index(['b', 'c'], dtype='object')

In [91]:
#index[1]='d' => typeError 발생. 색인객체는 변경 불가능

In [92]:
labels=pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [93]:
obj2=pd.Series([1.5,-2.5,0],index=labels)
print(obj2)

0    1.5
1   -2.5
2    0.0
dtype: float64

In [94]:
obj2.index is labels

True

In [95]:
frame3

state  hong1  hong3
year
2000     NaN    1.5
2001     2.4    1.7
2002     2.9    3.6

In [96]:
frame3.columns

Index(['hong1', 'hong3'], dtype='object', name='state')

In [97]:
'Ohio' in frame3.columns

False

In [98]:
2002 in frame3.index

True

In [99]:
dup_labels=pd.Index(['foo','foo','bar','bar'])
dup_labels ## pandas는 중복값허용

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 5.2 핵심기능

In [100]:
#5.2.1 재색인 5

In [101]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [102]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [103]:
obj3=pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [104]:
obj3.reindex(range(6),method='ffill') #ffill 값이 없는 경우 이전의 값으로 채움

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [105]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [106]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [107]:
#인덱스 수정하기
states=['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [108]:
frame.loc[['a','b','c','d'],states]

C:\Users\14qkr\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [109]:
#5.2.2 하나의 로우나 컬럼 삭제하기

In [110]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [111]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [112]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64